In [110]:
import pandas as pd
import numpy as np

## Create dataframe from array
### 1.1 Option 1

In [111]:
data = np.array([[1, 4], [2, 5], [3, 6]])
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

### 1.2 Option 2 (from List)

In [112]:
data = [[1, 4], [2, 5], [3, 6]]
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## Creating a DataFrame from dict

In [113]:
states = ['California', 'Texus', 'Florida', 'NY']
population = [123445, 12311, 54564, 453453]

# store list within a dict
dict_states = {'states': states, 'population': population}

# Create the dataframe
df_population = pd.DataFrame(dict_states)

# print dataframe
df_population

       states  population
0  California      123445
1       Texus       12311
2     Florida       54564
3          NY      453453

## Creating Dataframe from CSV

In [114]:
# reading the csv file
df_exams = pd.read_csv('test.csv')

# show first 5 rows in the DF
df_exams

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score
0,female,group b,some college,standard,completed,45,34,56
1,female,group b,some college,standard,completed,45,36,56
2,male,group c,some college,standard,completed,85,46,32
3,male,group d,some uni,standard,completed,85,46,32
4,male,group e,high school,standard,completed,85,46,32
5,male,group f,uni,standard,completed,85,46,32

In [115]:
# show first 5 rows in DF
df_exams.head()

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score
0,female,group b,some college,standard,completed,45,34,56
1,female,group b,some college,standard,completed,45,36,56
2,male,group c,some college,standard,completed,85,46,32
3,male,group d,some uni,standard,completed,85,46,32
4,male,group e,high school,standard,completed,85,46,32

In [116]:
# show last 5 rows in DF
df_exams.tail(2)

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score
4,male,group e,high school,standard,completed,85,46,32
5,male,group f,uni,standard,completed,85,46,32

# Attribute

In [117]:
# display N rows
# pd.set_option('display.max_rows', 7)
# df_exams

In [118]:
# getting access to the shape attribute
df_exams.shape

(6, 8)

In [119]:
# getting access to the index attribute
df_exams.index

RangeIndex(start=0, stop=6, step=1)

In [120]:
# getting access to column attribute
df_exams.columns

Index(['gender', 'race', 'parental level', 'lunch', 'test preparation',
       'math score', 'reading score', 'writing score'],
      dtype='object')

In [121]:
# data types of column
df_exams.dtypes

gender            object
race              object
parental level    object
                   ...
math score         int64
reading score      int64
writing score      int64
Length: 8, dtype: object

# Methods

In [122]:
# showing the info of the dataframe
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   gender            6 non-null      object
 1   race              6 non-null      object
 2   parental level    6 non-null      object
 3   lunch             6 non-null      object
 4   test preparation  6 non-null      object
 5   math score        6 non-null      int64
 6   reading score     6 non-null      int64
 7   writing score     6 non-null      int64
dtypes: int64(3), object(5)
memory usage: 516.0+ bytes

In [123]:
# describe basic statistics of the dataframe
df_exams.describe()

       math score  reading score  writing score
count    6.000000       6.000000       6.000000
mean    71.666667      42.333333      40.000000
std     20.655911       5.715476      12.393547
...           ...            ...            ...
50%     85.000000      46.000000      32.000000
75%     85.000000      46.000000      50.000000
max     85.000000      46.000000      56.000000

[8 rows x 3 columns]

# Functions

In [124]:
# the highest index of the dataframe
max(df_exams.index)

5

In [125]:
min(df_exams.index)

0

In [126]:
# the length of the dataframe(no of rows)
len(df_exams)

6

In [127]:
# data type
type(df_exams)

pandas.core.frame.DataFrame

In [128]:
# rounding the values of the dataset
round(df_exams, 2)

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score
0,female,group b,some college,standard,completed,45,34,56
1,female,group b,some college,standard,completed,45,36,56
2,male,group c,some college,standard,completed,85,46,32
3,male,group d,some uni,standard,completed,85,46,32
4,male,group e,high school,standard,completed,85,46,32
5,male,group f,uni,standard,completed,85,46,32

# Added new column with an array

In [129]:
language_score = np.arange(0, 6)

In [130]:
# length of the array
len(language_score)

6

In [131]:
# adding a new column to dataframe with an array
df_exams['language score'] = language_score
df_exams

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score
0,female,group b,some college,standard,completed,45,34,56,0
1,female,group b,some college,standard,completed,45,36,56,1
2,male,group c,some college,standard,completed,85,46,32,2
3,male,group d,some uni,standard,completed,85,46,32,3
4,male,group e,high school,standard,completed,85,46,32,4
5,male,group f,uni,standard,completed,85,46,32,5

In [132]:
# create random integer number between 1 to 100
int_language_score = np.random.randint(1, 100, size=6)

In [133]:
# min value inclusive and max value exclusive
min(int_language_score)
max(int_language_score)

88

In [134]:
# adding a new column to dataframe with an array
df_exams['language score'] = int_language_score
df_exams

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score
0,female,group b,some college,standard,completed,45,34,56,47
1,female,group b,some college,standard,completed,45,36,56,88
2,male,group c,some college,standard,completed,85,46,32,70
3,male,group d,some uni,standard,completed,85,46,32,85
4,male,group e,high school,standard,completed,85,46,32,13
5,male,group f,uni,standard,completed,85,46,32,11

In [135]:
# create random float numbers between 1 to 100
np.random.uniform(1, 100, size=6)

array([71.34360282, 64.27990124, 54.85988266, 53.98073994, 74.224672  ,
       17.87903353])

# Math operations
## 1.1 Operations in column

In [136]:
# 1.1 Operations in columns
# sum
df_exams['math score'].sum()

430

In [137]:
# count, mean, std, max, and min
df_exams['math score'].count()
df_exams['math score'].mean()
df_exams['math score'].max()
df_exams['math score'].min()

45

In [138]:
# easier calculation with .describe()
df_exams.describe()

       math score  reading score  writing score  language score
count    6.000000       6.000000       6.000000        6.000000
mean    71.666667      42.333333      40.000000       52.333333
std     20.655911       5.715476      12.393547       34.453834
...           ...            ...            ...             ...
50%     85.000000      46.000000      32.000000       58.500000
75%     85.000000      46.000000      50.000000       81.250000
max     85.000000      46.000000      56.000000       88.000000

[8 rows x 4 columns]

## Operations in rows

In [139]:
# calculating the sum in rows
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0    135
1    137
2    163
3    163
4    163
5    163
dtype: int64

In [140]:
# calculating the average score and assigning the result to a new column
df_exams['average'] = (df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']) / 3
df_exams

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score,average
0,female,group b,some college,standard,completed,45,34,56,47,45.000000
1,female,group b,some college,standard,completed,45,36,56,88,45.666667
2,male,group c,some college,standard,completed,85,46,32,70,54.333333
3,male,group d,some uni,standard,completed,85,46,32,85,54.333333
4,male,group e,high school,standard,completed,85,46,32,13,54.333333
5,male,group f,uni,standard,completed,85,46,32,11,54.333333

In [141]:
# showing the dataframe
df_exams.round(2)

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score,average
0,female,group b,some college,standard,completed,45,34,56,47,45.00
1,female,group b,some college,standard,completed,45,36,56,88,45.67
2,male,group c,some college,standard,completed,85,46,32,70,54.33
3,male,group d,some uni,standard,completed,85,46,32,85,54.33
4,male,group e,high school,standard,completed,85,46,32,13,54.33
5,male,group f,uni,standard,completed,85,46,32,11,54.33

## Value counts

In [142]:
# counting gender element
df_exams['gender'].count()

6

In [143]:
# counting gender element by category
df_exams['gender'].value_counts()

gender
male      4
female    2
Name: count, dtype: int64

In [144]:
# return the relative frequency(divide all values by the sum of values)
df_exams['gender'].value_counts(normalize=True)

gender
male      0.666667
female    0.333333
Name: proportion, dtype: float64

In [145]:
# counting parental level elements by category
df_exams['parental level'].value_counts()

parental level
 some college    3
 some uni        1
 high school     1
 uni             1
Name: count, dtype: int64

In [146]:
# return the relative frequency and round to decimals
df_exams['parental level'].value_counts(normalize=True).round(2)

parental level
 some college    0.50
 some uni        0.17
 high school     0.17
 uni             0.17
Name: proportion, dtype: float64

# Sort a DataFrame

In [147]:
# sort by one column
df_exams.sort_values(by='math score', ascending=False)

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score,average
2,male,group c,some college,standard,completed,85,46,32,70,54.333333
3,male,group d,some uni,standard,completed,85,46,32,85,54.333333
4,male,group e,high school,standard,completed,85,46,32,13,54.333333
5,male,group f,uni,standard,completed,85,46,32,11,54.333333
0,female,group b,some college,standard,completed,45,34,56,47,45.000000
1,female,group b,some college,standard,completed,45,36,56,88,45.666667

In [148]:
# sort descending by multiple columns
df_exams.sort_values(by=['math score', 'reading score'], ascending=False)

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score,average
2,male,group c,some college,standard,completed,85,46,32,70,54.333333
3,male,group d,some uni,standard,completed,85,46,32,85,54.333333
4,male,group e,high school,standard,completed,85,46,32,13,54.333333
5,male,group f,uni,standard,completed,85,46,32,11,54.333333
1,female,group b,some college,standard,completed,45,36,56,88,45.666667
0,female,group b,some college,standard,completed,45,34,56,47,45.000000

In [150]:
# sort descending by multiple columns and update dataframe
df_exams.sort_values(by=['math score', 'reading score'], ascending=False, inplace=True)
df_exams

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score,average
2,male,group c,some college,standard,completed,85,46,32,70,54.333333
3,male,group d,some uni,standard,completed,85,46,32,85,54.333333
4,male,group e,high school,standard,completed,85,46,32,13,54.333333
5,male,group f,uni,standard,completed,85,46,32,11,54.333333
1,female,group b,some college,standard,completed,45,36,56,88,45.666667
0,female,group b,some college,standard,completed,45,34,56,47,45.000000

In [151]:
# sort descending with a key function
df_exams.sort_values('race', ascending=True, key=lambda col: col.str.lower())

,gender,race,parental level,lunch,test preparation,math score,reading score,writing score,language score,average
1,female,group b,some college,standard,completed,45,36,56,88,45.666667
0,female,group b,some college,standard,completed,45,34,56,47,45.000000
2,male,group c,some college,standard,completed,85,46,32,70,54.333333
3,male,group d,some uni,standard,completed,85,46,32,85,54.333333
4,male,group e,high school,standard,completed,85,46,32,13,54.333333
5,male,group f,uni,standard,completed,85,46,32,11,54.333333